In [3]:
mysql://scott:tiger@mysql:3306/default

In [4]:
show tables;

,Tables_in_default
0,castings
1,countries
2,genres
3,movies
4,peoples
5,purchase_20201025
6,purchase_20201026
7,rates
8,seoul_popular_trip
9,user_20201025
10,user_20201026

In [8]:
-- left outer join 이므로 왼쪽 테이블(movies)의 갯수만큼 조회 됩니다
select m.movie, m.title, m.year, m.grade from movies m left outer join castings c 
on m.movie = c.movie and c.`leading` = 1 and c.`order` = 1 limit 10

,movie,title,title_eng,year,grade,movie,people,order,leading
0,10001,시네마 천국,"Cinema Paradiso , 1988",2013.0,전체 관람가,10001,4374,1,1
1,10002,빽 투 더 퓨쳐,"Back To The Future , 1985",2015.0,12세 관람가,10002,1076,1,1
2,10003,빽 투 더 퓨쳐 2,"Back To The Future Part 2 , 1989",2015.0,12세 관람가,10003,1076,1,1
3,10004,빽 투 더 퓨쳐 3,"Back To The Future Part III , 1990",1990.0,전체 관람가,10004,1076,1,1
4,10005,스타워즈 에피소드 4 - 새로운 희망,"Star Wars , 1977",1997.0,PG,10005,1007,1,1
5,10006,스타워즈 에피소드 5 - 제국의 역습,"Star Wars Episode V: The Empire Strikes Back , 1980",1997.0,PG,10006,1007,1,1
6,10007,스타워즈 에피소드 6 - 제다이의 귀환,"Star Wars: Episode VI: Return Of The Jedi , 1983",1997.0,PG,10007,1007,1,1
7,10008,슈퍼맨,"Superman , 1978",1979.0,PG,10008,1017,1,1
8,10009,슈퍼맨 2,"Superman II , 1980",1981.0,PG,10009,473,1,1
9,10010,슈퍼맨 3,"Superman III , 1983",NaN,전체 관람가,10010,262,1,1

In [84]:
select count(1) -- t.time, t.timestamp, m.movie, m.year, m.grade, m.title, p.korean, r.country, g.genre, t.rate
from castings c 
    inner join movies m on c.movie = m.movie and c.`leading` = 1 and c.`order` = 1
    inner join peoples p on c.people = p.people
    inner join countries r on c.movie = r.movie
    inner join genres g on c.movie = g.movie
    inner join rates t on c.movie = t.movie
order by time asc
 limit 10

,count(1)
0,3786249

In [107]:
select count(1)
from castings c inner join movies m on c.movie = m.movie and c.leading = 1 and c.order = 1
 limit 5

,count(1)
0,988

In [106]:
select count(1) from movies

,count(1)
0,999

In [130]:
select r.timestamp, r.rate, m.movie, m.year, m.grade, m.title
    , (select p.korean from peoples p inner join castings c on p.people = c.people and c.movie = m.movie and c.leading = 1 and c.order = 1) as main_actor
    , (select t.country from countries t where t.movie = m.movie limit 1) as country
    , (select g.genre from genres g where g.movie = m.movie limit 1) as genre
    , r.time
 from movies m inner join rates r on m.movie = r.movie
 limit 5

,timestamp,rate,movie,year,grade,title,main_actor,country,genre,time
0,2017-05-07 12:34:00,7,10003,2015,12세 관람가,빽 투 더 퓨쳐 2,마이클 J. 폭스,미국,SF,1494128040
1,2016-07-03 16:10:00,7,10004,1990,전체 관람가,빽 투 더 퓨쳐 3,마이클 J. 폭스,미국,서부,1467529800
2,2017-12-15 22:22:00,9,10018,2011,전체 관람가,이티,헨리 토마스,미국,판타지,1513344120
3,2015-02-21 14:53:00,9,10021,2017,12세 관람가,록키,실베스터 스탤론,미국,드라마,1424497980
4,2015-03-29 20:09:00,7,10022,1980,12세 관람가,록키 2,실베스터 스탤론,미국,드라마,1427627340

In [9]:
select * from peoples limit 5;

,people,korean,original
0,5,아담 볼드윈,Adam Baldwin
1,8,애드리안 라인,Adrian Lyne
2,9,에이단 퀸,Aidan Quinn
3,13,구로사와 아키라,Akira Kurosawa
4,15,알 파치노,Al Pacino

In [30]:
select count(distinct movie) from castings where `order` = 1 and `leading` = 1 limit 10;

,count(distinct movie)
0,988

In [83]:
select count(1) from rates

,count(1)
0,140710

In [59]:
describe rates

,Field,Type,Null,Key,Default,Extra
0,user,int,YES,,None,
1,movie,int,YES,MUL,None,
2,rate,int,YES,,None,
3,time,int,YES,,None,
4,timestamp,text,YES,,None,

In [114]:
select * from genres limit 10

,movie,genre
0,10001,드라마
1,10001,멜로/로맨스
2,10002,SF
3,10002,코미디
4,10003,SF
5,10003,코미디
6,10004,서부
7,10004,SF
8,10004,판타지
9,10004,코미디

In [132]:
drop table if exists korean_movies

In [ ]:
create table korean_movies as 
select r.timestamp, r.rate, m.movie, m.year, m.grade, m.title
    , (select p.korean from peoples p inner join castings c on p.people = c.people and c.movie = m.movie and c.leading = 1 and c.order = 1) as main_actor
    , (select t.country from countries t where t.movie = m.movie limit 1) as country
    , (select g.genre from genres g where g.movie = m.movie limit 1) as genre
    , r.time
 from movies m inner join rates r on m.movie = r.movie